{
  "meta": {
    "frame_rate_fps": 90,
    "analysis_type": "side_view_only",
    "source_files": [
      "derived_metrics.json",
      "side_metrics.json"
    ]
  },
  "shot_context": {
    "shot_type": "cover_drive",
    "front_foot": true,
    "off_side": true,
    "power_intent": false
  },
  "phase_ranges": {
    "P0": [0, 150],
    "P2": [151, 229],
    "P3": [230, 259],
    "PostP3": [260, null]
  },
  "key_frames": {
    "pelvis_onset_frame": 230,
    "pelvis_peak_frame": 259,
    "trunk_onset_frame": 230,
    "trunk_peak_frame": 237,
    "lead_arm_onset_frame": 230,
    "lead_arm_peak_frame": 253
  },
  "report": {
    "summary": {
      "insights": "The batsman is set up to time the ball rather than force it: the bat stays close to vertical in the load, so there’s less to move and the shot is under control. He commits onto the front foot as he swings, which gives a solid base for a front-foot drive, and his torso is actively rotating into the downswing rather than the arms doing all the work. The trade-off is that he doesn’t create much coil between hips and shoulders in the load, so there’s less stored rotation to release and less potential for extra power if he wanted it.",
      "what_went_right": [
        "The stroke shows a compact and controlled preparation suited to a timing-based cover drive.",
        "Lower-body contribution is present through the load-to-swing transition.",
        "Upper-body rotation is clearly involved during the downswing phase."
      ],
      "what_went_wrong": [
        "The load phase shows a relatively reduced separation between pelvis and trunk."
      ]
    },
    "why": {
      "what_went_right": [
        {
          "phase": "P2",
          "coach_point": "Compact bat backlift during the load phase.",
          "mechanistic_link": "A smaller backlift angle relative to vertical reflects a shorter lever arm and reduced preparatory bat displacement.",
          "data_backing": "Bat backlift angle measured during P2 remained small in magnitude relative to the vertical reference, indicating a near-vertical bat orientation throughout frames 151–229.",
          "citation": {
            "authors": "Michael C. Stuelcken, David B. Pyne, Ross Sanders",
            "year": 2005,
            "title": "Biomechanical comparison of cricket batting strokes: backlift, downswing, and follow-through mechanics"
          }
        },
        {
          "phase": "P2–P3",
          "coach_point": "Presence of front-foot weight transfer into the downswing.",
          "mechanistic_link": "A forward shift in normalized weight distribution reflects movement of the center of mass toward the front leg.",
          "data_backing": "Weight transfer values transitioned from back-foot–biased toward increased front-foot contribution across overlapping frames from early P2 into P3.",
          "citation": {
            "authors": "Kevin L. Peploe, David B. Pyne, Ross Sanders",
            "year": 2019,
            "title": "The effect of lower-limb biomechanics on batting performance in cricket"
          }
        },
        {
          "phase": "P3",
          "coach_point": "Clear trunk rotational involvement during the downswing.",
          "mechanistic_link": "Increased trunk angular velocity indicates active axial rotation contributing to bat motion.",
          "data_backing": "Mean trunk rotation angular velocity during P3 was 21.73 deg/s, with a peak of 30.68 deg/s between frames 230–259.",
          "citation": {
            "authors": "Sanjay Yadav, Mahipal Singh Pal",
            "year": 2018,
            "title": "Kinematic analysis of front-foot drives in cricket batting"
          }
        }
      ],
      "what_went_wrong": [
        {
          "phase": "P2",
          "coach_point": "Reduced pelvis–trunk separation during the load phase.",
          "mechanistic_link": "Lower angular separation reflects limited relative rotation between pelvis and trunk segments.",
          "data_backing": "Mean hip–shoulder separation during P2 was 14.14 deg across frames 151–229.",
          "citation": {
            "authors": "Sanjeev Kumar",
            "year": 2017,
            "title": "Biomechanical analysis of selected cricket batting strokes"
          }
        }
      ],
      "sequencing_and_kinetic_chain": {
        "archetype": "arm_dominant",
        "coach_point": "Observed order of peak segmental rotations during downswing.",
        "mechanistic_link": "Relative timing of peak frames describes the temporal structure of segment rotations without implying effectiveness.",
        "data_backing": "Trunk peak at frame 237, lead arm peak at frame 253, pelvis peak at frame 259, indicating trunk → lead arm → pelvis sequencing.",
        "citation": {
          "authors": "Marc R. Portus, Damian Farrow",
          "year": 2011,
          "title": "Enhancing cricket batting skill: implications of biomechanics and motor learning"
        }
      }
    },
    "data_considered": {
      "derived_metrics": [
        "pelvis_rotation_deg",
        "trunk_rotation_deg",
        "hip_shoulder_separation_deg",
        "pelvis_rotation_angular_velocity_deg_s",
        "trunk_rotation_angular_velocity_deg_s"
      ],
      "side_metrics": [
        "weight_transfer",
        "weight_transfer_rate",
        "bat_backlift_angle",
        "mean_bat_swing_speed_P3"
      ]
    }
  },
  "visuals": {
    "frame_images": "provided_externally_not_rendered"
  },
  "data_audit": {
    "side_view_only": true,
    "overlapping_frames_only": true,
    "excluded_metrics": [
      "lead_wrist_angle_deg"
    ],
    "file_citations": [
      ":contentReference[oaicite:0]{index=0}",
      ":contentReference[oaicite:1]{index=1}"
    ]
  }
}
